<template lang="">
    <header class="box">
        <div class="intro">
            <h1 class="intro__title">Драгон мани</h1>
            <p class="intro__subtitle">Изучаем мнения и анализируем лучшее казино в рунете</p>
            <p class="intro__description">Каждый день на нашем портале собираются тысячи игроков, которые оставляют отзывы на форумах и отзывах. Мы решили просмотреть топовые тусовочные места в гемблинге и собрали самые ценные мнения любителей азартных развлечений об официальном сайте Драгон Мани. Наша цель - обеспечить игроков надежной информацией и помочь им в выборе лучшего казино</p>
            <svg width="71" height="56" viewBox="0 0 71 56" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_2_858)">
                <path d="M51.642 51.6356C61.4638 50.1392 68.8388 42.8297 68.1812 35.0648L67.209 28.6833C65.7386 20.7722 56.6694 19.3457 46.6941 20.8654C36.7187 22.3851 29.3225 26.3005 30.0717 34.3116L30.0575 34.4119L30.9946 40.5632C32.9333 48.1329 41.825 53.1312 51.642 51.6356Z" fill="url(#paint0_linear_2_858)"/>
                <path d="M30.1379 33.9726C31.3426 41.88 40.6285 47.0244 50.8784 45.4628C61.1284 43.9013 68.4611 36.2251 67.2564 28.3177C66.0518 20.4102 56.7659 15.2659 46.5159 16.8274C36.2659 18.389 28.9333 26.0651 30.1379 33.9726Z" fill="url(#paint1_linear_2_858)"/>
                <path d="M30.6499 33.1434C31.7928 40.6454 40.6849 45.5135 50.5109 44.0165C60.3369 42.5196 67.3759 35.2245 66.233 27.7225C65.0901 20.2205 56.198 15.3524 46.372 16.8494C36.546 18.3463 29.507 25.6414 30.6499 33.1434Z" fill="url(#paint2_linear_2_858)"/>
                <path d="M34.4061 31.1818C35.2467 36.6989 42.0204 40.2434 49.5356 39.0984C57.0509 37.9535 62.4618 32.5528 61.6213 27.0356C60.7807 21.5184 54.0071 17.974 46.4918 19.1189C38.9766 20.2639 33.5656 25.6646 34.4061 31.1818Z" fill="url(#paint3_linear_2_858)"/>
                <path d="M34.9572 31.7361C35.7456 36.9114 42.2021 40.2206 49.3782 39.1274C56.5542 38.0341 61.7324 32.9524 60.944 27.7771C60.1555 22.6017 53.699 19.2925 46.523 20.3858C39.3469 21.479 34.1687 26.5607 34.9572 31.7361Z" fill="url(#paint4_linear_2_858)"/>
                <path opacity="0.1" d="M47.5304 17.5566C47.5075 18.1149 47.6038 18.5862 47.7302 18.9647C55.1882 18.2261 61.7307 21.9524 62.5904 27.595C63.45 33.2376 58.2248 38.8352 50.7886 40.297C50.8377 40.8443 50.765 40.7866 51.0587 41.8121C51.2999 42.6542 51.1676 42.5909 51.5238 43.2534C60.865 41.1479 67.023 34.5834 65.8994 27.2087C64.7759 19.8339 57.4525 15.9125 47.9265 16.6764C47.7011 16.9366 47.5445 17.2304 47.5297 17.5518L47.5304 17.5566Z" fill="white"/>
                <path opacity="0.2" d="M50.1131 37.6358C56.3607 36.4287 60.7915 31.9979 60.1073 27.5068C59.4231 23.0158 53.7898 20.0691 47.4063 20.8354C47.1279 23.4553 46.9367 29.8374 50.1131 37.6358Z" fill="white"/>
                <path opacity="0.1" d="M27.7858 47.0858C27.2916 47.1611 26.2438 42.9906 25.4478 37.7654C24.6517 32.5402 24.41 28.2468 24.9043 28.1715C25.3985 28.0962 26.4462 32.2668 27.2423 37.492C28.0383 42.7172 28.28 47.0105 27.7858 47.0858Z" fill="black"/>
                </g>
                <path d="M53.7062 16.14L48.9987 8.82054L41.3543 13.737C37.2383 14.815 32.453 16.756 27.8062 19.7446C23.1595 22.7332 19.4118 26.2875 16.7203 29.5805L8.83221 34.6537L13.5398 41.9732C16.7727 46.9999 28.3896 45.285 39.4723 38.1571C50.5551 31.0292 56.9358 21.1615 53.7062 16.14Z" fill="url(#paint5_linear_2_858)"/>
                <path d="M53.1691 15.3049L48.4616 7.98537L40.8172 12.9018C36.7012 13.9798 31.9159 15.9208 27.2691 18.9094C22.6223 21.898 18.8746 25.4523 16.1832 28.7453L8.2951 33.8186L13.0027 41.1381C16.2356 46.1647 27.8525 44.4498 38.9352 37.3219C50.018 30.194 56.402 20.3315 53.1691 15.3049Z" fill="url(#paint6_linear_2_858)"/>
                <path d="M9.16724 34.8783C12.3789 39.8719 23.9752 38.1363 35.0683 31.0017C46.1614 23.8672 52.5506 14.0353 49.3389 9.04173C46.1272 4.04812 34.5309 5.78371 23.4379 12.9183C12.3448 20.0528 5.95559 29.8847 9.16724 34.8783Z" fill="url(#paint7_linear_2_858)"/>
                <path d="M9.39701 33.6966C12.3489 38.2862 23.4234 36.4233 34.1327 29.5355C44.842 22.6478 51.1306 13.3436 48.1788 8.75392C45.2269 4.16427 34.1524 6.02722 23.4431 12.9149C12.7338 19.8027 6.44516 29.1069 9.39701 33.6966Z" fill="url(#paint8_linear_2_858)"/>
                <path d="M13.3705 30.459C15.4748 33.7308 23.7655 32.148 31.8884 26.9237C40.0113 21.6994 44.8904 14.812 42.7862 11.5402C40.6819 8.26846 32.3912 9.85128 24.2682 15.0756C16.1453 20.2998 11.2663 27.1872 13.3705 30.459Z" fill="url(#paint9_linear_2_858)"/>
                <path d="M32.0543 26.817C23.8395 32.1004 15.4812 33.7067 13.5695 30.7343C11.918 28.1665 16.9133 21.3312 25.1281 16.0478C33.3429 10.7644 41.0427 8.84092 42.7809 11.5436C44.8094 14.6976 40.2691 21.5336 32.0543 26.817Z" fill="url(#paint10_linear_2_858)"/>
                <path opacity="0.1" d="M26.0213 12.364C26.0507 12.6605 26.0856 12.9314 26.1227 13.1715C33.8677 8.79896 41.3373 7.77146 43.4158 11.0032C45.4943 14.235 41.5104 20.5226 34.4086 25.7355C34.5031 25.814 34.6028 25.8892 34.7058 25.9696C35.1821 26.3453 35.795 26.7284 36.451 27.0985C45.2637 20.6019 50.1775 12.785 47.6219 8.8114C45.0663 4.83781 35.749 6.093 26.0863 11.5303C26.0267 11.8253 25.9964 12.1087 26.0213 12.364Z" fill="white"/>
                <path opacity="0.1" d="M27.0264 15.4429C27.0264 15.4429 39.181 8.1463 42.1496 11.6563C42.1496 11.6563 45.6818 15.3244 33.987 24.738C28.5811 20.9036 27.0264 15.4429 27.0264 15.4429Z" fill="white"/>
                <path opacity="0.1" d="M14.1217 52.6355C13.5875 52.9791 10.2093 48.6839 6.576 43.0348C2.94273 37.3857 0.435726 32.5301 0.969896 32.1866C1.50407 31.843 4.88234 36.1382 8.5156 41.7873C12.1489 47.4365 14.6559 52.292 14.1217 52.6355Z" fill="black"/>
                <defs>
                <linearGradient id="paint0_linear_2_858" x1="67.9268" y1="33.3951" x2="30.7651" y2="39.0566" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.23" stop-color="#E9C200"/>
                <stop offset="0.61" stop-color="#DD8E00"/>
                <stop offset="1" stop-color="#AA6300"/>
                </linearGradient>
                <linearGradient id="paint1_linear_2_858" x1="67.2564" y1="28.3177" x2="30.1379" y2="33.9726" gradientUnits="userSpaceOnUse">
                <stop offset="0.07" stop-color="#FFFBBF"/>
                <stop offset="1" stop-color="#D47800"/>
                </linearGradient>
                <linearGradient id="paint2_linear_2_858" x1="66.233" y1="27.7225" x2="30.6499" y2="33.1434" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.32" stop-color="#E9C300"/>
                <stop offset="0.69" stop-color="#FFD215"/>
                <stop offset="1" stop-color="#D4A000"/>
                </linearGradient>
                <linearGradient id="paint3_linear_2_858" x1="34.4061" y1="31.1818" x2="61.6165" y2="27.0364" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.5" stop-color="#E9C300"/>
                <stop offset="1" stop-color="#D48000"/>
                </linearGradient>
                <linearGradient id="paint4_linear_2_858" x1="60.944" y1="27.7771" x2="34.9524" y2="31.7368" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.32" stop-color="#E9CE00"/>
                <stop offset="0.7" stop-color="#DDA400"/>
                <stop offset="1" stop-color="#D48D00"/>
                </linearGradient>
                <linearGradient id="paint5_linear_2_858" x1="53.6595" y1="16.0674" x2="13.4931" y2="41.9006" gradientUnits="userSpaceOnUse">
                <stop stop-color="#FFB900"/>
                <stop offset="0.5" stop-color="#FFAE15"/>
                <stop offset="1" stop-color="#7F4700"/>
                </linearGradient>
                <linearGradient id="paint6_linear_2_858" x1="53.1258" y1="15.2374" x2="12.9593" y2="41.0706" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.23" stop-color="#E9C200"/>
                <stop offset="0.61" stop-color="#DD8E00"/>
                <stop offset="1" stop-color="#AA6300"/>
                </linearGradient>
                <linearGradient id="paint7_linear_2_858" x1="49.3389" y1="9.04173" x2="9.16724" y2="34.8783" gradientUnits="userSpaceOnUse">
                <stop offset="0.07" stop-color="#FFFBBF"/>
                <stop offset="1" stop-color="#D47800"/>
                </linearGradient>
                <linearGradient id="paint8_linear_2_858" x1="23.4431" y1="12.9149" x2="34.1327" y2="29.5355" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.32" stop-color="#E9C300"/>
                <stop offset="0.69" stop-color="#FFD215"/>
                <stop offset="1" stop-color="#D4A000"/>
                </linearGradient>
                <linearGradient id="paint9_linear_2_858" x1="27.6848" y1="31.0573" x2="28.3917" y2="12.9765" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.5" stop-color="#E9C300"/>
                <stop offset="1" stop-color="#D48000"/>
                </linearGradient>
                <linearGradient id="paint10_linear_2_858" x1="43.1279" y1="12.0831" x2="13.733" y2="30.9885" gradientUnits="userSpaceOnUse">
                <stop stop-color="#F8FF94"/>
                <stop offset="0.32" stop-color="#E9CE00"/>
                <stop offset="0.7" stop-color="#DDA400"/>
                <stop offset="1" stop-color="#D48D00"/>
                </linearGradient>
                <clipPath id="clip0_2_858">
                <rect width="35.1831" height="42.7546" fill="white" transform="translate(65.0752 14) rotate(81.3378)"/>
                </clipPath>
                </defs>
            </svg>
        </div>
        <button class="button">перейти на сайт игры</button>
        <div class="wrapper">
            <div class="review" v-for="(item, index) of reviews" :key="index">
                <p class="review__text">{{item.text}}</p>
                <p class="review__user">{{item.user}}</p>
            </div>
        </div>
        <img src="../assets/logo.png" alt="">

    </header>
</template>
<script>
export default {
    name:'HeaderApp',
    data() {
        return {
            reviews:[
                {
                    text:'"Я недавно начал играть на сайте Dragon Money и остался в восторге от результатов. Мой баланс постоянно растет благодаря игрулям. Я любитель покера, но слоты здесь тоже оказались достойными внимания. Особенно мне понравились тикеты - минимум усилий и максимум результата. Я просто сижу и стираю билетики, иногда выигрываю неплохие деньги."',
                    user:'Gamer'
                },
                {
                    text:'"Я давно мечтаю купить себе новую крутую видеокарту и решил попробовать удачу в казино. После долгого поиска я нашел суперское казино - Dragon Money. Этот сайт работает идеально, поддержка всегда готова помочь, а внутренний чат добавляет еще больше впечатлений. Кроме того, есть бонус при регистрации на сайте. "',
                    user:'Gamer'
                },
            ]
        }
    },

    computed:{

    }
}
</script>