<template>
  <div class="container">
    <transition name="fade" appear>
      <HeaderApp/>
    </transition>
    <section>
      <plus-app v-for="(item, index) of plusesDesctiption" :key="index" :title="item.title" :text="item.text"/>
      <div class="findings box">
        <h3 class="findings__title">Как работают выводы в Dragon Money, качество обслуживания и поддержки </h3>
        <p class="findings__desc" v-for="(item,index) in boxDescriptions" :key="index">{{ item }}</p>
      </div>
      <plus-app title="Заключение" :text="endingText" :new-class="ending"/>
      <div class="center">
        <button class="button">перейти на сайт игры</button>
      </div>

    </section>
    
  </div>
</template>

<script>
import HeaderApp from './components/HeaderApp.vue';
import PlusApp from './components/PlusApp.vue';


export default {
  name: 'App',
  components: {
    HeaderApp,
    PlusApp
  },
  data() {
    return {
      plusesDesctiption:[
                {
                    title:'Как начать играть новичку на Dragon Money?',
                    text:'Dragon Money - это отличный выбор для тех, кто ищет казино с хорошим приветственным бонусом. Каждому новому пользователю предлагается 50 монет, что по внутреннему обменному курсу соответствует 5 рублям. Это не очень много, но достаточно для того, чтобы попробовать играть во все слоты и другие развлечения на портале. И если игрок решит залить деньги, то его ждет еще больше поощрений.'
                },
                {
                    title:'Еще больше бонусов',
                    text:`Драгон Мани заботится о своих лояльных пользователях и награждает их дополнительными поощрениями. Например, привязав свой аккаунт в Телеграм и ВК, а также включив двухфакторную идентификацию, можно получить дополнительные 30 монет на баланс. Или просто за первый депозит и нажатие кнопки в ЛК можно получить 15 монет. Это не встречается на других интернет-казино. Администрация Dragon Money даже платит за посещение сайта, чтобы привлечь гемблеров и сформировать активное комьюнити вокруг проекта.`
                },
                {
                    title:'Реферальная программа',
                    text:'Администрация Dragon Money создала партнерскую программу, которая позволяет зарабатывать как рефералам, так и рефоводам и самому проекту. В личном кабинете каждый пользователь может найти свою реферальную ссылку, которую можно передавать друзьям и знакомым в группах и чатах. При переходе по этой ссылке приглашенный получит 50 монет, а рефовод будет получать процент (до 50%) от всех сделанных взносов. Это дает возможность зарабатывать деньги не только через игры, но и при участии в партнерской программе.'
                },
            ],
      boxDescriptions:[
        'В мире онлайн-казино много отзывов о собственных играх, которые хвалят их качество и захватывающий игровой процесс. Однако, необходимо оставаться начеку и играть только в тех казино, где не возникают проблемы с выплатами.',
        '“Я играл в казино dragon money около года и могу с уверенностью сказать, что это одно из лучших мест, где я когда-либо играл. Я особенно любил играть в игры с высокой волатильностью, такие как джекпоты, и несколько раз удачно поднимал на них. Кроме того, я никогда не испытывал никаких проблем с выводом денег и деньги всегда поступали на мой счет в течение 2 дней. Я очень рекомендую dragon money как надежное и качественное казино.”',
        '"Когда я делал свой первый вывод, я думал, что это будет большой бедой. Но оказалось, что все очень просто - запросили документы, я их подал и все решилось быстро и без проблем. Деньги пришли на следующий день в биткоин - я играю через него, потому что не хочу мои деньги гонять по картам мани. В общем, я очень доволен работой казино."'
      ],
      endingText:'Драгон Мани - это место, где азарт и выигрыш сочетаются в идеальном балансе. Мы предлагаем вам самые разнообразные игровые режимы, которые созданы нашими специалистами и игровые автоматы от лучших производителей софта. Крупные бонусы, реферальная программа и соревнования позволят вам зарабатывать деньги в нашем казино. Но не забывайте, что гемблинг - это, в первую очередь, азарт и все зависит от вашей удачи. Зарегистрируйтесь на нашем сайте и получите приветственный бонус на баланс, который можно использовать в любой игре. Присоединяйтесь к нам и наслаждайтесь игрой в ДрагонМани!'
    }
  },
}
</script>

<style lang="scss">

@import '@/assets/css/style.scss'
</style>
